src/DataProcessors/Обслуживание_СМСШлюз_DEVINO.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>Обслуживание_СМСШлюз_DEVINO</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТО</Name>
					<Comment>Текущий объект торгового оборудования</Comment>
					<Type>
						<v8:Type>cfg:CatalogObject.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/Обслуживание_СМСШлюз_DEVINO/Forms/Форма/module.bsl
//////////////////////////////////////////////////////////////////////
//ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ОК(Кнопка)
	
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(Логин) Тогда
		Сообщить("Необходимо заполнить ""Логин""!", СтатусСообщения.Важное);
		Отказ = Истина;		
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Пароль) Тогда
		Сообщить("Необходимо заполнить ""Пароль""!", СтатусСообщения.Важное);	
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыТО.Логин       = Логин;
	ПараметрыТО.Пароль      = Пароль;
	ПараметрыТО.Отправитель = Отправитель;

	Закрыть("ОК");
	
КонецПроцедуры

Процедура БалансНажатие(Элемент)
	
	Перем Баланс;
	
	Результат.Ошибка = Ложь;
    УзнатьБаланс(Баланс); 
	
	Если Результат.Ошибка Тогда
		Предупреждение(Результат.Описание);
	Иначе
		Предупреждение("Текущий баланс: " + Строка(Баланс));
	КонецЕсли;
		
КонецПроцедуры

Процедура СсылкаРегистрацияНажатие(Элемент)
	
	ЗапуститьПриложение("https://my.stream-telecom.ru/Account/Register");
	
КонецПроцедуры
